set_app_var fml_mode_on true
set_fml_appmode FPV 

set_fml_var fml_cov_gen_trace on
set design FIFOFV 

########################################################
## Compile & Setup
########################################################
# Compilation Step 
read_file -top $design -format sverilog  -sva \
  -vcs { +define+INLINE_SVA -f filelist.f } 

create_clock clk -period 100
create_reset rst -low
sim_run -stable
sim_save_reset
check_fv -block 
report_fv -list 

